artifacts/merged.yml
---
execution:
- concurrency: 20
  ramp-up: 30s
  scenario: testit-jmx
modules:
  consolidator:
    buffer-multiplier: 2
    buffer-scale-choice: 0.5
    generalize-labels: false
    ignore-labels:
    - ignore
    max-buffer-len: 2h
    min-buffer-len: 2s
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
    rtimes-len: 500
  jmeter:
    gui: false
reporting:
- module: blazemeter
- dump-csv: final-stats.csv
  module: final-stats
- module: console
- module: junit-xml
scenarios:
  testit-jmx:
    script: testit.jmx