artifacts/testit.yml
---
scenarios:
  testit-jmx:
    script: testit.jmx

execution:
- scenario: testit-jmx
  concurrency: 20
  ramp-up: 30s

reporting:
- module: blazemeter
- module: final-stats
  dump-csv: final-stats.csv
- module: console
- module: junit-xml

modules:
  jmeter:
    gui: false
  consolidator:
    generalize-labels: false  # replace digits and UUID sequences 
                              # with N and U to decrease label count
    ignore-labels: # sample labels from this list 
      - ignore     # will be ignored by results reader
      
    buffer-scale-choice: 0.5  # choose middle value from following percentiles list (95.0)
    buffer-multiplier: 2  # make buffer two times bigger than need to receive 95% samples
    min-buffer-len: 2s      # minimal length of buffer (default: 2s)
    max-buffer-len: 2h      # maximal length of buffer (default: infinity)
    
    rtimes-len: 500         # size of storage for response time values (default: 1000)  
        
    percentiles: 
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0